xiaochenqi123/GD32F470_DP83640_LWIP_FREERTOS/GD32F4xx_Demo/Hardware/DP83640/inc/epl_regs.h
// PHY_PG2_FREQ100 Def's
#define P849_FREQ_OFFSET_MASK    0x00FF
#define P849_FREQ_OFFSET_SHIFT   0
#define P849_SEL_FC              0x0100
#define P849_SAMPLE_FREQ         0x8000

// PHY_PG2_TDR_CTRL Def's
#define P849_RX_THRESHOLD_MASK   0x003F
#define P849_RX_THRESHOLD_SHIFT  0
#define P849_TDR_MIN_MODE        0x0080
#define P849_TDR_WIDTH_MASK      0x0700
#define P849_TDR_WIDTH_SHIFT     8
#define P849_SEND_TDR            0x0800
#define P849_RX_CHANNEL          0x1000
#define P849_TX_CHANNEL          0x2000
#define P849_TDR_100MB           0x4000
#define P849_TDR_ENABLE          0x8000

// PHY_PG2_TDR_WIN Def's
#define P849_TDR_STOP_MASK       0x00FF
#define P849_TDR_STOP_SHIFT      0
#define P849_TDR_START_MASK      0xFF00
#define P849_TDR_START_SHIFT     8

// PHY_PG2_TDR_PEAK Def's
#define P849_TDR_PEAK_TIME_MASK  0x00FF
#define P849_TDR_PEAK_TIME_SHIFT 0
#define P849_TDR_PEAK_MASK       0x3F00
#define P849_TDR_PEAK_SHIFT      8

// PHY_PG2_TDR_THR Def's
#define P849_TDR_THR_TIME_MASK   0x00FF
#define P849_TDR_THR_TIME_SHIFT  0
#define P849_TDR_THR_MET         0x0100

// PHY_PG2_VAR_CTRL Def's
#define P849_VAR_ENABLE          0x0001
#define P849_VAR_TIMER_MASK      0x0006
#define P849_VAR_FREEZE          0x0008
#define P849_VAR_RDY             0x8000

// PHY_PG2_LQMR Def's
#define P849_C1_LO_WARN          0x0001
#define P849_C1_HI_WARN          0x0002
#define P849_DAGC_LO_WARN        0x0004
#define P849_DAGC_HI_WARN        0x0008
#define P849_DBLW_LO_WARN        0x0010
#define P849_DBLW_HI_WARN        0x0020
#define P849_FREQ_LO_WARN        0x0040
#define P849_FREQ_HI_WARN        0x0080
#define P849_FC_LO_WARN          0x0100
#define P849_FC_HI_WARN          0x0200
#define P849_BRK_LNK_C1          0x0400
#define P849_BRK_LNK_DAGC        0x0800
#define P849_BRK_LNK_DBLW        0x1000
#define P849_BRK_LNK_FREQ        0x2000
#define P849_BRK_LNK_FC          0x4000
#define P849_LQM_ENABLE          0x8000

// PHY_PG2_LQDR Def's
#define P849_LQ_THR_DATA_MASK    0x00FF
#define P849_LQ_THR_DATA_SHIFT   0
#define P849_LQ_THR_SEL          0x0100
#define P849_LQ_PARAM_SEL_MASK   0x0E00
#define P849_LQ_PARAM_SEL_SHIFT  9
#define P849_WRITE_LQ_THR        0x1000
#define P849_SAMPLE_PARAM        0x2000


//****************************************************************************
// DP83640 Specific Register Bit Definitions
//****************************************************************************

// PHY_PG0_PCFCR Def's
#define P640_PCFCR              0x001F
#define P640_PCF_EN             0x0001
#define P640_PCF_BUF_SHIFT      1
#define P640_PCF_BUF_MASK       0x001E
#define P640_PCF_BC_DIS         0x0020
#define P640_PCF_INT_CTL_SHIFT  6
#define P640_PCF_INT_CTL_MASK   0x00C0
#define P640_PCF_DA_SEL         0x0100
#define P640_PCF_STS_OK         0x4000
#define P640_PCF_STS_ERR        0x8000

// PHY_PG2_LQMR2 Def's
#define P640_RESTART_ON_VAR     0x0400
#define P640_VAR_HIGH_WARN      0x0002

// PHY_PG3_CGCR Def's
#define P640_DIS_TRIG_UPD_GATE  0x8000
#define P640_DIS_TX_TS_GATE     0x4000
#define P640_DIS_RX_TS_GATE     0x2000
#define P640_DIS_RX_INFO_GATE   0x1000
#define P640_DIS_EVNT_GATE      0x0800
#define P640_DIS_CLK_UPD_GATE   0x0400
#define P640_DIS_REG125_GATE    0x0200
#define P640_DIS_CLKTX_GATE     0x0100
#define P640_DIS_CLKRX_GATE     0x0080
#define P640_DIS_CLK125_GATE    0x0040
#define P640_DIS_CLKDIV_GATE    0x0020
#define P640_DIS_ADC125_GATE    0x0004
#define P640_DIS_ADC80_GATE     0x0002
#define P640_DIS_REGCLK_GATE    0x0001

// PHY_PG4_PTP_CTL Def's
#define P640_TRIG_SEL_SHIFT     10
#define P640_TRIG_SEL_MASK      0x1C00
#define P640_TRIG_DIS           0x0200
#define P640_TRIG_EN            0x0100
#define P640_TRIG_READ          0x0080
#define P640_TRIG_LOAD          0x0040
#define P640_PTP_RD_CLK         0x0020
#define P640_PTP_LOAD_CLK       0x0010
#define P640_PTP_STEP_CLK       0x0008
#define P640_PTP_ENABLE         0x0004
#define P640_PTP_DISABLE        0x0002
#define P640_PTP_RESET          0x0001

// PHY_PG4_PTP_STS Def's
#define P640_TXTS_RDY           0x0800
#define P640_RXTS_RDY           0x0400
#define P640_TRIG_DONE          0x0200
#define P640_EVENT_RDY          0x0100
#define P640_TXTS_IE            0x0008
#define P640_RXTS_IE            0x0004
#define P640_TRIG_IE            0x0002
#define P640_EVENT_IE           0x0001

// PHY_PG4_PTP_TSTS Def's
#define P640_TRIG7_ERROR        0x8000
#define P640_TRIG7_ACTIVE       0x4000
#define P640_TRIG6_ERROR        0x2000
#define P640_TRIG6_ACTIVE       0x1000
#define P640_TRIG5_ERROR        0x0800
#define P640_TRIG5_ACTIVE       0x0400
#define P640_TRIG4_ERROR        0x0200
#define P640_TRIG4_ACTIVE       0x0100
#define P640_TRIG3_ERROR        0x0080
#define P640_TRIG3_ACTIVE       0x0040
#define P640_TRIG2_ERROR        0x0020
#define P640_TRIG2_ACTIVE       0x0010
#define P640_TRIG1_ERROR        0x0008
#define P640_TRIG1_ACTIVE       0x0004
#define P640_TRIG0_ERROR        0x0002
#define P640_TRIG0_ACTIVE       0x0001

// PHY_PG4_PTP_RATEH Def's
#define P640_PTP_RATE_DIR       0x8000
#define P640_PTP_TMP_RATE       0x4000
#define P640_PTP_RATE_HI_MASK   0x03FF
#define P640_PTP_RATE_HI_SHIFT  16

// PHY_PG4_PTP_ESTS Def's
#define P640_EVNTS_MISSED_SHIFT 8
#define P640_EVNTS_MISSED_MASK  0x0700
#define P640_EVNTS_TS_LEN_SHIFT 6
#define P640_EVNTS_TS_LEN_MASK  0x00C0
#define P640_EVNT_RF            0x0020
#define P640_EVNT_NUM_SHIFT     2
#define P640_EVNT_NUM_MASK      0x001C
#define P640_MULT_EVENT         0x0002
#define P640_EVENT_DET          0x0001

// PHY_PG4_PTP_EDATA Def's
#define P640_E7_RISE            0x8000
#define P640_E7_DET             0x4000
#define P640_E6_RISE            0x2000
#define P640_E6_DET             0x1000
#define P640_E5_RISE            0x0800
#define P640_E5_DET             0x0400
#define P640_E4_RISE            0x0200
#define P640_E4_DET             0x0100
#define P640_E3_RISE            0x0080
#define P640_E3_DET             0x0040
#define P640_E2_RISE            0x0020
#define P640_E2_DET             0x0010
#define P640_E1_RISE            0x0008
#define P640_E1_DET             0x0004
#define P640_E0_RISE            0x0002
#define P640_E0_DET             0x0001

